<?php

namespace Tests\Unit;

use App\Models\Address;
use App\Models\User;
use PHPUnit\Framework\TestCase;

class ExampleTest extends TestCase
{
    public function testBasicTest()
    {
        dd(implode(User::client_type,','));

        $arr = [
            1 => [
                'name' => [
                    'ar' => 'خدمة المساعدة في اختيار البرنامج المحاسبي',
                    'en' => 'test',
                ],
                'details' => [
                    'ar' => 'تتيح لك هذه الخدمة المساعدة في امكانية اختيار البرنامج المحاسبي وفق نشاطك التحاري والاحتياجات الخاصة بالمشروع',
                    'en' => 'تتيح لك هذه الخدمة المساعدة في امكانية اختيار البرنامج المحاسبي وفق نشاطك التحاري والاحتياجات الخاصة بالمشروع',
                ],
            ],
            2 => [
                'name' => [
                    'ar' => 'تأسيس دليل الحسابات',
                    'en' => 'تأسيس دليل الحسابات',
                ],
                'details' => [
                    'ar' => 'تتيح لك هذه الخدمة امكانية تأسيس واعداد الدليل المحاسبي لنشاطك من خلال جلسة لمدة 4 ساعات لتمكن من استخدام البرنامج المحاسبي بكفاءة عالية',
                    'en' => 'تتيح لك هذه الخدمة امكانية تأسيس واعداد الدليل المحاسبي لنشاطك من خلال جلسة لمدة 4 ساعات لتمكن من استخدام البرنامج المحاسبي بكفاءة عالية',
                ],
            ],
            3 => [
                'name' => [
                    'ar' => 'خدمة التدريب',
                    'en' => 'خدمة التدريب',
                ],
                'details' => [
                    'ar' => 'تتيح لك هذه الخدمة امكانية تدريب موظفينك بشكل كامل على اي من البرامج المحاسبية من خلال تطبيق Zoom & Google Meet ,حيث نعمل على توفير افضل الاشخاص المؤهلين علميا وعمليا لتدريب الموظفين بكفاءة عالية',
                    'en' => 'تتيح لك هذه الخدمة امكانية تدريب موظفينك بشكل كامل على اي من البرامج المحاسبية من خلال تطبيق Zoom & Google Meet ,حيث نعمل على توفير افضل الاشخاص المؤهلين علميا وعمليا لتدريب الموظفين بكفاءة عالية',
                ],
            ],
        ];
        foreach ($arr as $index => $item) {
            dd($index,$item['name']['ar']);
            \App\Models\Service::create([
                'name' => $item['name'],
                'details' => $item['details'],
            ]);
        }

        dd(23);
        dd(collect(range(1,5))->random());

        $this->assertTrue(true);
    }
}
